alexcruzgtz/cgms-prototype/CGMS-Embedded/Software/Glucometer - I.C. - PIC24/Test Version - Reciever/Drivers/Wireless/MiWi_MRF89XA.c
/********************************************************************
* FileName:        MRF89XA.c
* Dependencies:    
* Processor:    PIC18, PIC24, PIC32, dsPIC30, dsPIC33
*               tested with 18F4620, dsPIC33FJ256GP710    
* Complier:     Microchip C18 v3.04 or higher
*               Microchip C30 v2.03 or higher
*               Microchip C32 v1.02 or higher        
* Company:      Microchip Technology, Inc.
*
* Copyright and Disclaimer Notice
*
* Copyright © 2007-2009 Microchip Technology Inc.  All rights reserved.
*
* Microchip licenses to you the right to use, modify, copy and distribute 
* Software only when embedded on a Microchip microcontroller or digital 
* signal controller and used with a Microchip radio frequency transceiver, 
* which are integrated into your product or third party product (pursuant 
* to the terms in the accompanying license agreement).   
*
* You should refer to the license agreement accompanying this Software for 
* additional information regarding your rights and obligations.
*
* SOFTWARE AND DOCUMENTATION ARE PROVIDED “AS IS” WITHOUT WARRANTY OF ANY 
* KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY 
* WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A 
* PARTICULAR PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE 
* LIABLE OR OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, 
* CONTRIBUTION, BREACH OF WARRANTY, OR OTHER LEGAL EQUITABLE THEORY ANY 
* DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT LIMITED TO 
* ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, 
* LOST PROFITS OR LOST DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS, 
* TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES (INCLUDING BUT 
* NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
*
*********************************************************************
* File Description:
*
*  This file provides transceiver driver functionality for MRF89XA 
*  subGHz transceiver. The transceiver driver interfaces are based 
*  on Microchip MAC strategy. The transceiver driver interfaces works 
*  with all Microchip wireless protocols
*
* Change History:
*  Rev   Date         Author    Description
*  3.1   5/28/2010    SM        MiWi DE 3.1
*  4.1   6/3/2011     SM        MAL v2011-06
********************************************************************/

#include "Drivers/Wireless/MiWi_ConfigApp.h"

#if defined(MRF89XA)
	#include <p24fxxxx.h>
	#include <GenericTypeDefs.h>
    #include "Drivers/SymbolTime.h"
    #include "Drivers/TimeDelay.h"
    #include "Drivers/UART_Handler.h"
	#include "Drivers/SPI_Handler.h"
	#include "Scheduler/HardwareConfig.h"
    #include "Drivers/Wireless/MiWi_ConfigMRF89XA.h"
    #include "Drivers/Wireless/MiWi_Security.h"
    #include "Drivers/Wireless/MiWi_MRF89XA.h"
    #include "Drivers/Wireless/MiWi_MCHP_MAC.h"
    #include "Drivers/Wireless/MiWi_MCHP_API.h"
    #include "Drivers/Wireless/MiWi_NVM.h"
	#include "Drivers/Wireless/MiWi_P2P.h"




/*-----------------------------------------------------------------------------------------*/
    volatile RX_PACKET  RxPacket[BANK_SIZE];
    volatile BOOL 		IRQ1_Received = 0;
    MACINIT_PARAM		MACInitParams;
    BYTE    TxMACSeq;
    BYTE    MACSeq;
    BYTE	ReceivedBankIndex;
    BYTE 	RF_Mode;
    BYTE 	RSSIVal;
    BYTE 	RSSILock;

/*.........................................................................................*/
    ROM BYTE PVALUE[]    = {CHANNEL1_PVALUE, CHANNEL2_PVALUE, CHANNEL3_PVALUE, CHANNEL4_PVALUE, CHANNEL5_PVALUE, CHANNEL6_PVALUE,
                            CHANNEL7_PVALUE, CHANNEL8_PVALUE, CHANNEL9_PVALUE, CHANNEL10_PVALUE, CHANNEL11_PVALUE, CHANNEL12_PVALUE,
                            CHANNEL13_PVALUE, CHANNEL14_PVALUE, CHANNEL15_PVALUE, CHANNEL16_PVALUE, CHANNEL17_PVALUE, CHANNEL18_PVALUE,
                            CHANNEL19_PVALUE, CHANNEL20_PVALUE, CHANNEL21_PVALUE, CHANNEL22_PVALUE, CHANNEL23_PVALUE, CHANNEL24_PVALUE,
                            CHANNEL25_PVALUE, CHANNEL26_PVALUE, CHANNEL27_PVALUE, CHANNEL28_PVALUE, CHANNEL29_PVALUE, CHANNEL30_PVALUE,
			    CHANNEL31_PVALUE, CHANNEL32_PVALUE};
    ROM BYTE SVALUE[]    = {CHANNEL1_SVALUE, CHANNEL2_SVALUE, CHANNEL3_SVALUE, CHANNEL4_SVALUE, CHANNEL5_SVALUE, CHANNEL6_SVALUE,
                            CHANNEL7_SVALUE, CHANNEL8_SVALUE, CHANNEL9_SVALUE, CHANNEL10_SVALUE, CHANNEL11_SVALUE, CHANNEL12_SVALUE,
                            CHANNEL13_SVALUE, CHANNEL14_SVALUE, CHANNEL15_SVALUE, CHANNEL16_SVALUE, CHANNEL17_SVALUE, CHANNEL18_SVALUE,
                            CHANNEL19_SVALUE, CHANNEL20_SVALUE, CHANNEL21_SVALUE, CHANNEL22_SVALUE, CHANNEL23_SVALUE, CHANNEL24_SVALUE,
                            CHANNEL25_SVALUE, CHANNEL26_SVALUE, CHANNEL27_SVALUE, CHANNEL28_SVALUE, CHANNEL29_SVALUE, CHANNEL30_SVALUE,
			    CHANNEL31_SVALUE, CHANNEL32_SVALUE};

/*.........................................................................................*/
    #if defined(ENABLE_ACK)
        volatile    BOOL hasAck = FALSE;
        #if defined(ENABLE_RETRANSMISSION)
            ACK_INFO    AckInfo[ACK_INFO_SIZE];
        #endif
    #endif
    
    #if defined(ENABLE_SECURITY)
        DWORD_VAL OutgoingFrameCounter; 
        BYTE key[KEY_SIZE];
    #endif
    
    volatile BYTE        MACTxBuffer[TX_PACKET_SIZE];     

/*-----------------------------------------------------------------------------------------*/
    //First time configuration settings for MRF89XA
    ROM WORD InitConfigRegs[] = {
        /* 0 */                     GCONREG | GCONREG_SET, 
        /* 1 */                     DMODREG | DMODREG_SET,
        /* 2 */                     FDEVREG | FREQ_DEV,
        /* 3 */                     BRREG | DATARATE,
        /* 4 */                     FLTHREG | FLTHREG_SET,
        /* 5 */                     FIFOCREG | FIFOCREG_SET,
        /* 6 */                     R1CNTREG | R1CNT,
        /* 7 */                     P1CNTREG | P1CNT,
        /* 8 */                     S1CNTREG | S1CNT,
        /* 9 */                     R2CNTREG,
        /* 10 */                    P2CNTREG,
        /* 11 */                    S2CNTREG,
        /* 12 */                    PACONREG | PACONREG_SET,
        /* 13 */                    FTXRXIREG | FTXRXIREG_SET,                     
        /* 14 */                    FTPRIREG | FTPRIREG_SET,
        /* 15 */                    RSTHIREG | RSTHIREG_SET,
        /* 16 */                    FILCONREG | FILCONREG_SET,
        /* 17 */                    PFILCREG | PFILCREG_SET,
        /* 18 */                    SYNCREG | SYNCREG_SET,
        /* 19 */                    RESVREG | RESVREG_SET,
        /* 20 */                    RSTSREG,
        /* 21 */                    OOKCREG,
        /* 22 */                    SYNCV31REG | SYNCV31REG_SET, // 1st byte of Sync word,
        /* 23 */                    SYNCV23REG | SYNCV23REG_SET, // 2nd byte of Sync word,
        /* 24 */                    SYNCV15REG | SYNCV15REG_SET, // 3rd byte of Sync word,
        /* 25 */                    SYNCV07REG | SYNCV07REG_SET, // 4th byte of Sync word,
        /* 26 */                    TXPARAMREG | TXPARAMREG_SET,
        /* 27 */                    CLKOUTREG | CLKOUTREG_SET,
        /* 28 */                    PLOADREG | PLOADREG_SET,
        /* 29 */                    NADDREG | NADDREG_SET,
        /* 30 */                    PCONREG | PCONREG_SET,
         /* 31 */                   FCRCREG | FCRCREG_SET 
                            };    

    void SPIPut(BYTE v);
    BYTE SPIGet(void);
    void SetRFMode(BYTE);
    BYTE RegisterRead(BYTE);

/*-----------------------------------------------------------------------------------------*/
	/*********************************************************************
     * WORD getReceiverBW(void)
     * Overview:        
     *              This function get the receiver band width setting
     *              based on RF deviation configuration
     * PreCondition:    
     *              RF deviation configuration has been done in the 
     *              C preprocessor
     * Input:       None
     * Output:      
     *          WORD    The configuration setting for receiver band width.
     *                  This output needs to be ORed with receiver 
     *                  configuration command
     * Side Effects:    None
     ********************************************************************/
    WORD getReceiverBW(void)
    {
        BYTE value;
        value = RegisterRead(FILCONREG>>8);
        return (WORD)(((value & 0x0F) + 1) * 25);
    }

/*.........................................................................................*/
    /*********************************************************************
     * void RegisterSet(INPUT WORD setting)
     * Overview:        
     *              This function access the control register of MRF89XA.
     *              The register address and the register settings are
     *              the input
     * PreCondition:    
     *              None
     * Input:       
     *          WORD    setting     The address of the register and its
     *                              corresponding settings
     * Output:  None    
     * Side Effects:    Register settings have been modified
     ********************************************************************/
    void RegisterSet(WORD setting)
    {
        BYTE IRQ1select = PHY_IRQ1_En;
        #if defined USE_IRQ0_AS_INTERRUPT
            BOOL IRQ0select = PHY_IRQ0_En;
            PHY_IRQ0_En = 0;
        #endif
        PHY_IRQ1_En = 0;
        Config_nCS = 0;
        SPIPut((BYTE)(setting >> 8));
        SPIPut((BYTE)setting);
        Config_nCS = 1;
        PHY_IRQ1_En = IRQ1select;
        #if defined USE_IRQ0_AS_INTERRUPT
            PHY_IRQ0_En = IRQ0select;
        #endif
    }
    
/*.........................................................................................*/
    /*********************************************************************
     * BYTE RegisterRead(BYTE)
     * Overview:        
     *              This function reads back the register values
     * PreCondition:    
     *              SPI needs to be intialised
     * Input:       None   
     * Output:      Returns the register readback value to the calling function       
     * Side Effects: None
     ********************************************************************/
    BYTE RegisterRead(BYTE address)
    {
        BYTE value;
        BYTE IRQ1select = PHY_IRQ1_En;
        #if defined USE_IRQ0_AS_INTERRUPT
            BOOL IRQ0select = PHY_IRQ0_En;
            
            PHY_IRQ0_En = 0;
        #endif
        PHY_IRQ1_En = 0;
        Config_nCS = 0;
        address = (address|0x40);
        SPIPut(address);
        value = SPIGet();
        Config_nCS = 1;
        PHY_IRQ1_En = IRQ1select;
        #if defined USE_IRQ0_AS_INTERRUPT
            PHY_IRQ0_En = IRQ0select;
        #endif
        return value;
    }

/*.........................................................................................*/
    /*********************************************************************
     * void WriteFIFO(BYTE Data)
     * Overview:        
     *              This function fills the FIFO
     * PreCondition:    
     *              MRF89XA transceiver has to be properly initialized
     * Input:       
     *              BYTE   Data - Data to be sent to FIFO.
     * Output:      None
     * Side Effects:    
     *              Fills the fifo
     ********************************************************************/
    void WriteFIFO(BYTE Data)
    {
        BYTE IRQ1select = PHY_IRQ1_En;
        #if defined USE_IRQ0_AS_INTERRUPT
            BOOL IRQ0select = PHY_IRQ0_En;
            PHY_IRQ0_En = 0;
        #endif
        PHY_IRQ1_En = 0;
        Data_nCS = 0;
        SPIPut(Data);
        Data_nCS = 1;
        PHY_IRQ1_En = IRQ1select;
        #if defined USE_IRQ0_AS_INTERRUPT
            PHY_IRQ0_En = IRQ0select;
        #endif
    }
    
/*.........................................................................................*/
    /*********************************************************************
     * BOOL TxPacket(INPUT BYTE TxPacketLen, INPUT BOOL CCA)
     * Overview:        
     *              This function send the packet in the buffer MACTxBuffer
     * PreCondition:    
     *              MRF89XA transceiver has been properly initialized
     * Input:       
     *              BYTE    TxPacketLen     The length of the packet to be
     *                                      sent.
     *              BOOL    CCA             The boolean to indicate if a 
     *                                      CCA operation needs to be done
     *                                      before sending the packet   
     * Output:      
     *              BOOL    The boolean to indicate if packet sent successful
     * Side Effects:    
     *              The packet has been sent out
     ********************************************************************/
    BOOL TxPacket(INPUT BYTE TxPacketLen, INPUT BOOL CCA)
    {
        BOOL status;
        BYTE i;
        MIWI_TICK t1, t2;
        #ifdef ENABLE_CCA
            BYTE CCARetries;
            BYTE rssival;
        #endif
    
        #if defined(ENABLE_ACK) && defined(ENABLE_RETRANSMISSION)
            BYTE reTry = RETRANSMISSION_TIMES;
        #endif
               
        #if defined(ENABLE_ACK) && defined(ENABLE_RETRANSMISSION)
            while( reTry-- )
        #endif
        {
            BYTE allowedTxFailure;
            allowedTxFailure = 0;

Start_Transmitting:
    
            #if defined(ENABLE_ACK)
                hasAck = FALSE;
            #endif
            
            #ifdef ENABLE_CCA
                CCARetries = 0;
        
                if( CCA )
                {
                   
Start_CCA:    
                    rssival = RegisterRead(RSTSREG>>8); 
                    rssival = (rssival>>1);            //Rssi value in dB
                
                    if( rssival > CCA_THRESHOLD )
                    {
                        if(CCARetries++ > CCA_RETRIES )
                        {
                            return FALSE;
                            
