alexcruzgtz/cgms-prototype/CGMS-Embedded/Software/Glucometer - I.C. - PIC24/Test Version - Reciever/Drivers/Wireless/MiWi_MRF89XA.c
        #if !defined(TARGET_SMALL)                    
            if(RF_Mode == RF_RECEIVER)
            {
                RSSIVal = (RegisterRead(RSTSREG>>8))>>1;        //Capturing the RSSiVal at SYNC/ADRS match
            }
        #endif
        return;
    }
	#endif

/*.........................................................................................*/	
    //void _ISRFAST __attribute__((interrupt, auto_psv)) _INT1Interrupt(void)
    void IRQ1_Handler (void)
	{
        if( PHY_IRQ1 && PHY_IRQ1_En )
        {
            if(RF_Mode == RF_RECEIVER)
            {
                BYTE RxPacketPtr;
                BYTE PacketLen;
                BYTE BankIndex;
                WORD counter;
                BOOL bAck;
                BYTE ackPacket[4];
                #if !defined(USE_IRQ0_AS_INTERRUPT)
                    #if !defined(TARGET_SMALL)                    
                        RSSIVal = (RegisterRead(RSTSREG>>8))>>1;        //Capturing the RSSiVal at SYNC/ADRS match
                    #endif
                #endif
                RSSILock = RSSIVal;
                //Extract the Packet Length Information
                Data_nCS = 0;             
                PacketLen = SPIGet();
                Data_nCS = 1;
    
                //get an available bank index for the received packet
                for(BankIndex = 0; BankIndex < BANK_SIZE; BankIndex++)
                {
                    if( RxPacket[BankIndex].flags.bits.Valid == FALSE )
                    {
                        break;
                    }
                }            
                
                 // may be an acknowledgement (If packetlen = 2, packet information = 
                if( PacketLen == 2 )    
                {
                    bAck = TRUE;
                }
                else
                {
                    bAck = FALSE;
                }

                //discard the packet if one of the following conditions is true
                if( PacketLen >= RX_PACKET_SIZE || PacketLen == 0 || (BankIndex >= BANK_SIZE && (bAck==FALSE)) )
                {
IGNORE_HERE:       
                    {
                        BYTE fifo_stat = RegisterRead(FTXRXIREG>>8);
                        while(fifo_stat & 0x02)
                        {
                            Data_nCS = 0;
                            SPIGet();
                            Data_nCS = 1;
                            fifo_stat = RegisterRead(FTXRXIREG>>8);            //read the contents of the fifo (to clear the FIFO)
                        }
                    }               
                    goto RETURN_HERE;
                }
                
                RxPacketPtr = 0;
                counter = PacketLen;

                while(counter >= 1)
                {
                    counter--;
                    if(1)
                    {
                        //if ack packet store in memory structure for ack
                        if( bAck )
                        {
                            Data_nCS = 0;
                            ackPacket[RxPacketPtr++] = SPIGet();
                            Data_nCS = 1;
                        }
                        //else use the bank
                        else
                        {
                            Data_nCS = 0;
                            RxPacket[BankIndex].Payload[RxPacketPtr++] = SPIGet();
                            Data_nCS = 1;
                        }
                        
                        //after reading the all the fifo contents
                        if( RxPacketPtr >= PacketLen ) 
                        {
                            BYTE i; 
                            
                            if( bAck )
                            {
                                #if defined(ENABLE_ACK)
                                    if( ( ackPacket[0] & PACKET_TYPE_MASK ) == PACKET_TYPE_ACK )        //verify that the packet format is ACK packet
                                    {    
                                        if( ackPacket[1] == TxMACSeq )                                    //verify the Sequence number in ACK packet
                                        {
                                            hasAck = TRUE;                                                //indicate hasACK (if valid ack)
                                        }
                                        RxPacketPtr = 0;
                                        goto RETURN_HERE;
                                    }
                                    else
                                #endif
                                if( BankIndex >= BANK_SIZE )                                        //if banks are not available discard the packet
                                {
                                    RxPacketPtr = 0;
                                    goto IGNORE_HERE;
                                }
                                RxPacket[BankIndex].Payload[0] = ackPacket[0];                        //else copy the 2 byte contents of the packet in the bank
                                RxPacket[BankIndex].Payload[1] = ackPacket[1];
                             
                            }
                            
                            RxPacket[BankIndex].PayloadLen = PacketLen;                                //set the packet length of the packet                   
                       
                            
                            // send ack / check ack
                            #if defined(ENABLE_ACK1)
                                if( ( RxPacket[BankIndex].Payload[0] & PACKET_TYPE_MASK ) == PACKET_TYPE_ACK )  // acknowledgement
                                {
                                    if( RxPacket[BankIndex].Payload[1] == TxMACSeq )                            
                                    {
                                        hasAck = TRUE;
                                    }
        
                                    RxPacketPtr = 0;
                                    RxPacket[BankIndex].PayloadLen = 0;
                                }
                                else 
                            #endif                                                
                            {
                                BYTE ackInfoIndex = 0xFF;
                                
